<a href="https://colab.research.google.com/github/timcsmith/MIS536-Public/blob/master/Notebooks/Class02_3_Cleaning_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# Class 2 Part 3: Retrieving data found within a DataFrame

Author: Dr. T. Smith (timsmith@iastate.edu) (Fall, 2020)

DataFrames are a powerful pandas data type that stores data in tabular form (rows and columns). 

Let's explore a few basic operations to display and select data found within a dataFrame.

In [ ]:
import pandas as pd # libarary for dataframes (and other)
import numpy as np # numpy library

In [ ]:
# Load data into dataframe
housing_df = pd.read_csv("https://github.com/timcsmith/MIS536-Public/raw/master/Data/WestRoxbury.csv")

## Renaming Columns

### Geting list of columns

In [ ]:
housing_df.columns

Index(['TOTAL VALUE ', 'TAX', 'LOT SQFT ', 'YR BUILT', 'GROSS AREA ',
       'LIVING AREA', 'FLOORS ', 'ROOMS', 'BEDROOMS ', 'FULL BATH',
       'HALF BATH', 'KITCHEN', 'FIREPLACE', 'REMODEL'],
      dtype='object')

### Explicit renaming of column

In [ ]:
housing_df = housing_df.rename(columns={'TOTAL VALUE ': 'TOTAL_VALUE'})# explicit

### Renaminging columns based on code (dynamically)

In [ ]:
housing_df.columns = [s.strip().replace(' ','_') for s in housing_df.columns] # list comprehension, all columns

## Renaming Rows

### Getting list of rows

In [ ]:
housing_df.index.values

array([   0,    1,    2, ..., 5799, 5800, 5801])

Notice that the code above provides a numpy array. 

There are times where we want to create a data frame from array data...

In [ ]:
rows_df = pd.DataFrame() # create an empty dataframe
rows_df['ROWS']= housing_df.index.values # get the index values (aka rows indexes)
rows_df # display result

      ROWS
0        0
1        1
2        2
3        3
4        4
...    ...
5797  5797
5798  5798
5799  5799
5800  5800
5801  5801

[5802 rows x 1 columns]

### Renaming rows based on code (dyamically)

To preserve our original housing_df data, we'll take two copies and store them in tmp1_df and temp2_df.

In [ ]:
tmp1_df = housing_df.copy()
tmp2_df = housing_df.copy()

Notice that all the row indices are integers from 0 to the end. Let's add 100 to every current index value...

In [ ]:
tmp2_df.rename(index=lambda s: s + 100)

      TOTAL_VALUE   TAX  LOT_SQFT  ...  KITCHEN  FIREPLACE  REMODEL
100         344.2  4330      9965  ...        1          0     None
101         412.6  5190      6590  ...        1          0   Recent
102         330.1  4152      7500  ...        1          0     None
103         498.6  6272     13773  ...        1          1     None
104         331.5  4170      5000  ...        1          0     None
...           ...   ...       ...  ...      ...        ...      ...
5897        404.8  5092      6762  ...        1          1   Recent
5898        407.9  5131      9408  ...        1          1     None
5899        406.5  5113      7198  ...        1          1     None
5900        308.7  3883      6890  ...        1          0     None
5901        447.6  5630      7406  ...        1          1     None

[5802 rows x 14 columns]

In the code below, we cast (translate) the integer value of a row to a string value, and concatenate ROW# to the start of each row index string.

In [ ]:
tmp2_df.rename(index=lambda s: "ROW#" + str(s))

          TOTAL_VALUE   TAX  LOT_SQFT  ...  KITCHEN  FIREPLACE  REMODEL
ROW#0           344.2  4330      9965  ...        1          0     None
ROW#1           412.6  5190      6590  ...        1          0   Recent
ROW#2           330.1  4152      7500  ...        1          0     None
ROW#3           498.6  6272     13773  ...        1          1     None
ROW#4           331.5  4170      5000  ...        1          0     None
...               ...   ...       ...  ...      ...        ...      ...
ROW#5797        404.8  5092      6762  ...        1          1   Recent
ROW#5798        407.9  5131      9408  ...        1          1     None
ROW#5799        406.5  5113      7198  ...        1          1     None
ROW#5800        308.7  3883      6890  ...        1          0     None
ROW#5801        447.6  5630      7406  ...        1          1     None

[5802 rows x 14 columns]

## Editing/Cleaning values in a DataFrame

### Changing a single value

In [ ]:
tmp1_df = housing_df.copy() # create a copy of our dataframe, so we preserve the original;
tmp1_df.loc[0,'TOTAL_VALUE'] = 1000000
tmp1_df.head(2)

   TOTAL_VALUE   TAX  LOT_SQFT  YR_BUILT  ...  HALF_BATH  KITCHEN  FIREPLACE  REMODEL
0    1000000.0  4330      9965      1880  ...          1        1          0     None
1        412.6  5190      6590      1945  ...          1        1          0   Recent

[2 rows x 14 columns]

### Changing a column of values

In [ ]:
tmp1_df = housing_df.copy()
tmp1_df['TOTAL_VALUE']=10
tmp1_df

      TOTAL_VALUE   TAX  LOT_SQFT  ...  KITCHEN  FIREPLACE  REMODEL
0              10  4330      9965  ...        1          0     None
1              10  5190      6590  ...        1          0   Recent
2              10  4152      7500  ...        1          0     None
3              10  6272     13773  ...        1          1     None
4              10  4170      5000  ...        1          0     None
...           ...   ...       ...  ...      ...        ...      ...
5797           10  5092      6762  ...        1          1   Recent
5798           10  5131      9408  ...        1          1     None
5799           10  5113      7198  ...        1          1     None
5800           10  3883      6890  ...        1          0     None
5801           10  5630      7406  ...        1          1     None

[5802 rows x 14 columns]

In [ ]:
tmp1_df = housing_df.copy()
tmp1_df['TOTAL_VALUE']=tmp1_df['TAX']
tmp1_df

      TOTAL_VALUE   TAX  LOT_SQFT  ...  KITCHEN  FIREPLACE  REMODEL
0            4330  4330      9965  ...        1          0     None
1            5190  5190      6590  ...        1          0   Recent
2            4152  4152      7500  ...        1          0     None
3            6272  6272     13773  ...        1          1     None
4            4170  4170      5000  ...        1          0     None
...           ...   ...       ...  ...      ...        ...      ...
5797         5092  5092      6762  ...        1          1   Recent
5798         5131  5131      9408  ...        1          1     None
5799         5113  5113      7198  ...        1          1     None
5800         3883  3883      6890  ...        1          0     None
5801         5630  5630      7406  ...        1          1     None

[5802 rows x 14 columns]

In [ ]:
tmp1_df = housing_df.copy()
tmp1_df['TOTAL_VALUE']=tmp1_df['TOTAL_VALUE']+1000
tmp1_df

      TOTAL_VALUE   TAX  LOT_SQFT  ...  KITCHEN  FIREPLACE  REMODEL
0          1344.2  4330      9965  ...        1          0     None
1          1412.6  5190      6590  ...        1          0   Recent
2          1330.1  4152      7500  ...        1          0     None
3          1498.6  6272     13773  ...        1          1     None
4          1331.5  4170      5000  ...        1          0     None
...           ...   ...       ...  ...      ...        ...      ...
5797       1404.8  5092      6762  ...        1          1   Recent
5798       1407.9  5131      9408  ...        1          1     None
5799       1406.5  5113      7198  ...        1          1     None
5800       1308.7  3883      6890  ...        1          0     None
5801       1447.6  5630      7406  ...        1          1     None

[5802 rows x 14 columns]

### Replacing missing data with median

In the code below, I do a random sample of rows (sample 10), and the change the BEDROOMS variable in these rows to be -1

In [ ]:
tmp1_df = housing_df.copy() # create a copy of the original dataframe
missing_rows = tmp1_df.sample(10).index
tmp1_df.loc[missing_rows, 'BEDROOMS'] = np.nan
print('Number of rows with valid BEDROOMS values after setting to NAN: ', tmp1_df['BEDROOMS'].count())
print('Number of rows with invalid BEDROOMS values after setting to NAN: ', len(tmp1_df) - housing_df['BEDROOMS'].count())

Number of rows with valid BEDROOMS values after setting to NAN:  5792
Number of rows with invalid BEDROOMS values after setting to NAN:  0

In the code below, we simply drop those rows with a np.nan value

In [ ]:
median_bedrooms = tmp1_df['BEDROOMS'].median()
tmp1_df.BEDROOMS = tmp1_df.BEDROOMS.fillna(value=median_bedrooms)
print('Number of rows with valid BEDROOMS values after setting to NAN: ', tmp1_df['BEDROOMS'].count())
print('Number of rows with invalid BEDROOMS values after setting to NAN: ', len(tmp1_df) - housing_df['BEDROOMS'].count())

Number of rows with valid BEDROOMS values after setting to NAN:  5802
Number of rows with invalid BEDROOMS values after setting to NAN:  0

### Replacing bad data with median

Let's add some "bad data" to our bedrooms (we'll add -1)

In [ ]:
tmp1_df = housing_df.copy() # create a copy of the original dataframe
missing_rows = tmp1_df.sample(10).index
tmp1_df.loc[missing_rows, 'BEDROOMS'] = np.nan
print('Number of rows with valid BEDROOMS values after setting to NAN: ', tmp1_df['BEDROOMS'].count())
print('Number of rows with invalid BEDROOMS values after setting to NAN: ', len(tmp1_df) - housing_df['BEDROOMS'].count())

Number of rows with valid BEDROOMS values after setting to NAN:  5792
Number of rows with invalid BEDROOMS values after setting to NAN:  0

Now let's replace those -1 values with the median

In [ ]:
median_bedrooms = tmp1_df['BEDROOMS'].median()
tmp1_df['BEDROOMS'] = tmp1_df['BEDROOMS'].replace([-1],median_bedrooms)
print('Number of rows with valid BEDROOMS values after setting to NAN: ', tmp1_df['BEDROOMS'].count())
print('Number of rows with invalid BEDROOMS values after setting to NAN: ', len(tmp1_df) - housing_df['BEDROOMS'].count())

Number of rows with valid BEDROOMS values after setting to NAN:  5792
Number of rows with invalid BEDROOMS values after setting to NAN:  0

### Dropping Rows or Columns

In [ ]:
tmp1_df = housing_df.copy() # create a copy of the original dataframe
tmp1_df.head(3)

   TOTAL_VALUE   TAX  LOT_SQFT  YR_BUILT  ...  HALF_BATH  KITCHEN  FIREPLACE  REMODEL
0        344.2  4330      9965      1880  ...          1        1          0     None
1        412.6  5190      6590      1945  ...          1        1          0   Recent
2        330.1  4152      7500      1890  ...          1        1          0     None

[3 rows x 14 columns]

In [ ]:
tmp1_df.drop('TOTAL_VALUE', axis=1, inplace=True) # single column drop

In [ ]:
tmp1_df.drop(['TAX', 'LOT_SQFT'], axis=1, inplace=True) # multi column drop

In [ ]:
tmp1_df.drop(1, axis=0, inplace=True) # single row drop

In [ ]:
tmp1_df.drop([0,4,5], axis=0, inplace=True) # multi row drop

In [ ]:
tmp1_df.reset_index(inplace=True) # here we reset the index -- starting from 0

In [ ]:
tmp1_df

      index  YR_BUILT  GROSS_AREA  ...  KITCHEN  FIREPLACE  REMODEL
0         2      1890        2294  ...        1          0     None
1         3      1957        5032  ...        1          1     None
2         6      1954        3220  ...        1          0     None
3         7      1950        2208  ...        1          0     None
4         8      1958        2582  ...        1          1   Recent
...     ...       ...         ...  ...      ...        ...      ...
5793   5797      1938        2594  ...        1          1   Recent
5794   5798      1950        2414  ...        1          1     None
5795   5799      1987        2480  ...        1          1     None
5796   5800      1946        2000  ...        1          0     None
5797   5801      1950        2510  ...        1          1     None

[5798 rows x 12 columns]

## DataFrame copying

The assignment operator (the equals sign) doesn't do what you might expect it to do - it does not create a copy of the dataframe.

### Assignment operator doesn't create a copy of the DataFrame

In this section, I'll create a new datafram called df1. Then, I'll attempt to make a copy of df1 into df2. Notice what happens when I make changes to df1? You should notice that the changes I made to df1 were also made to df2. 

Why is that? 

The assignment operator didn't create a copy of df1 into df2, but rather created a new dataframe variable that references the same data in df1.

In [ ]:
df1= pd.DataFrame()
df1['COL1'] = [1,2,3,4]
df1

   COL1
0     1
1     2
2     3
3     4

In [ ]:
df2 = df1
df2

   COL1
0     1
1     2
2     3
3     4

In [ ]:
df1.loc[0,'COL1']  = 123
df1

   COL1
0   123
1     2
2     3
3     4

In [ ]:
df2

   COL1
0   123
1     2
2     3
3     4

### This is what you do when you really want to make a full copy of a DataFrame

If we want to make a copy  of a data frame, we need to use the copy method. This is illustrated below...

In [ ]:
df1= pd.DataFrame()
df1['COL1'] = [1,2,3,4]
df1

   COL1
0     1
1     2
2     3
3     4

In [ ]:
df2=df1.copy()
df2

   COL1
0     1
1     2
2     3
3     4

In [ ]:
df1.loc[0,'COL1']  = 123
df1

   COL1
0   123
1     2
2     3
3     4

In [ ]:
df2

   COL1
0     1
1     2
2     3
3     4